Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
        <register>
          <name>OTP_SHADOW_PARTB308</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB309</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB310</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB311</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB312</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB313</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB314</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB315</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB316</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB317</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB318</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB319</name>
          <description>OTP shadow register</description>
          <addressOffset>0x4FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB320</name>
          <description>OTP shadow register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB321</name>
          <description>OTP shadow register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB322</name>
          <description>OTP shadow register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB323</name>
          <description>OTP shadow register</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB324</name>
          <description>OTP shadow register</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB325</name>
          <description>OTP shadow register</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB326</name>
          <description>OTP shadow register</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB327</name>
          <description>OTP shadow register</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB328</name>
          <description>OTP shadow register</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB329</name>
          <description>OTP shadow register</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB330</name>
          <description>OTP shadow register</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB331</name>
          <description>OTP shadow register</description>
          <addressOffset>0x52C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB332</name>
          <description>OTP shadow register</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB333</name>
          <description>OTP shadow register</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB334</name>
          <description>OTP shadow register</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB335</name>
          <description>OTP shadow register</description>
          <addressOffset>0x53C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB336</name>
          <description>OTP shadow register</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB337</name>
          <description>OTP shadow register</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB338</name>
          <description>OTP shadow register</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB339</name>
          <description>OTP shadow register</description>
          <addressOffset>0x54C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB340</name>
          <description>OTP shadow register</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB341</name>
          <description>OTP shadow register</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
