Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
        <cluster>
          <dim>14</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>FLEXCOMM_TRIG[%s]</name>
          <description>Array of registers: LP_FLEXCOMM_TRIG</description>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>LP_FLEXCOMM_TRIG</name>
            <description>LP_FLEXCOMM Input Connections</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TRIGIN</name>
                <description>LP_FLEXCOMM Input Trigger</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>val0</name>
                    <description>Selects CTIMER_C_INP0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val1</name>
                    <description>Selects CTIMER_C_INP1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val2</name>
                    <description>Selects CTIMER_C_INP2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val3</name>
                    <description>Selects CTIMER_C_INP3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val4</name>
                    <description>Selects SCT0_OUT3</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val5</name>
                    <description>Selects SCT0_OUT6</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val6</name>
                    <description>Selects SCT0_OUT9</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val7</name>
                    <description>Selects CTIMER0_MAT3</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val8</name>
                    <description>Selects CTIMER1_MAT3</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val9</name>
                    <description>Selects CTIMER2_MAT3</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val10</name>
                    <description>Selects CTIMER3_MAT3</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val11</name>
                    <description>Selects CTIMER4_MAT3</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val12</name>
                    <description>Selects PINT0 boolean pattern-match output</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val13</name>
                    <description>Selects ACMP0 CMPO</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val14</name>
                    <description>Selects RTC_SS0 interrupt</description>
                    <value>0xE</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>CTIMER[%s]</name>
          <description>Array of registers: CTIMER_CAP%s, CTIMER_TRIG</description>
          <addressOffset>0x600</addressOffset>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>CTIMER_CAP%s</name>
            <description>CTIMER Input Connections</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1F</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CAPIN</name>
                <description>CTIMER input capture</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>val0</name>
                    <description>Selects CTIMER_C_INP0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val1</name>
                    <description>Selects CTIMER_C_INP1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val2</name>
                    <description>Selects CTIMER_C_INP2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val3</name>
                    <description>Selects CTIMER_C_INP3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val4</name>
                    <description>Selects CTIMER_C_INP4</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val5</name>
                    <description>Selects CTIMER_C_INP5</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val6</name>
                    <description>Selects CTIMER_C_INP6</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val7</name>
                    <description>Selects CTIMER_C_INP7</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val8</name>
                    <description>Selects CTIMER_C_INP8</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val9</name>
                    <description>Selects CTIMER_C_INP9</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val10</name>
                    <description>Selects CTIMER_C_INP10</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val11</name>
                    <description>Selects CTIMER_C_INP11</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val12</name>
                    <description>Selects CTIMER_C_INP12</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val13</name>
                    <description>Selects CTIMER_C_INP13</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val14</name>
                    <description>Selects CTIMER_C_INP14</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val15</name>
                    <description>Selects CTIMER_C_INP15</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val16</name>
                    <description>Selects SAI0_TX_SYNC</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val17</name>
                    <description>Selects SAI0_RX_SYNC</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val18</name>
                    <description>Selects SAI1_TX_SYNC</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val19</name>
                    <description>Selects SAI1_RX_SYNC</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val20</name>
                    <description>Selects SAI2_TX_SYNC</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val21</name>
                    <description>Selects SAI2_RX_SYNC</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val22</name>
                    <description>Selects USB0 start of frame</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val23</name>
                    <description>Selects USB1 start of frame</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val24</name>
                    <description>Selects ACMP0 CMPO</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val25</name>
                    <description>Selects ADC0 trigger completion flag 0</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val26</name>
                    <description>Selects ADC0 trigger completion flag 1</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val27</name>
                    <description>Selects ITRC TMPR_OUT[0]</description>
                    <value>0x1B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val28</name>
                    <description>Selects ITRC TMPR_OUT[1]</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTIMER_TRIG</name>
            <description>CTIMER Input Connections</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1F</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TRIGIN</name>
                <description>CTIMER Input Trigger</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>val0</name>
                    <description>Selects CTIMER_C_INP0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val1</name>
                    <description>Selects CTIMER_C_INP1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val2</name>
                    <description>Selects CTIMER_C_INP2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val3</name>
                    <description>Selects CTIMER_C_INP3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val4</name>
                    <description>Selects CTIMER_C_INP4</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val5</name>
                    <description>Selects CTIMER_C_INP5</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val6</name>
                    <description>Selects CTIMER_C_INP6</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val7</name>
                    <description>Selects CTIMER_C_INP7</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val8</name>
                    <description>Selects CTIMER_C_INP8</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val9</name>
                    <description>Selects CTIMER_C_INP9</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val10</name>
                    <description>Selects CTIMER_C_INP10</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val11</name>
                    <description>Selects CTIMER_C_INP11</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val12</name>
                    <description>Selects CTIMER_C_INP12</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val13</name>
                    <description>Selects CTIMER_C_INP13</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val14</name>
                    <description>Selects CTIMER_C_INP14</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val15</name>
                    <description>Selects CTIMER_C_INP15</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val16</name>
                    <description>Selects SAI0_TX_SYNC</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val17</name>
                    <description>Selects SAI0_RX_SYNC</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val18</name>
                    <description>Selects SAI1_TX_SYNC</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val19</name>
                    <description>Selects SAI1_RX_SYNC</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val20</name>
                    <description>Selects SAI2_TX_SYNC</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val21</name>
                    <description>Selects SAI2_RX_SYNC</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val22</name>
                    <description>Selects USB0 start of frame</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val23</name>
                    <description>Selects USB1 start of frame</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val24</name>
                    <description>Selects ACMP0 CMPO</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val25</name>
                    <description>Selects ADC0 trigger completion flag 0</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val26</name>
                    <description>Selects ADC0 trigger completion flag 1</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val27</name>
                    <description>Selects ITRC TMPR_OUT[0]</description>
                    <value>0x1B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val28</name>
                    <description>Selects ITRC TMPR_OUT[1]</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FREQME_TRIG[%s]</name>
          <description>FREQME Clock Selection</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>FREQME Input Clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Selects main crystal oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Selects FRO1_DIV8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>Selects FRO1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>Selects LPOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>Selects OSC32KNP osc32k_out</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Selects FRO0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>Selects FRO2</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>Selects FREQME_GPIO_A_CLK</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>Selects FREQME_GPIO_B_CLK</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
