Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EZHV_TRIG[%s]</name>
          <description>EZH-V Input Connections</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>EZH-V Input Trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Selects GPIO0 peripheral output channel 0 trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Selects GPIO0 peripheral output channel 1 trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>Selects GPIO1 peripheral output channel 0 trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>Selects GPIO1 peripheral output channel 1 trigger</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>Selects GPIO2 peripheral output channel 0 trigger</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>Selects GPIO2 peripheral output channel 1 trigger</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Selects GPIO3 peripheral output channel 0 trigger</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>Selects GPIO3 peripheral output channel 1 trigger</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>Selects GPIO4 peripheral output channel 0 trigger</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>Selects GPIO4 peripheral output channel 1 trigger</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>Selects GPIO5 peripheral output channel 0 trigger</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>Selects GPIO5 peripheral output channel 1 trigger</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>Selects GPIO6 peripheral output channel 0 trigger</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>Selects GPIO6 peripheral output channel 1 trigger</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>Selects GPIO7 peripheral output channel 0 trigger</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>Selects GPIO7 peripheral output channel 1 trigger</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>Selects LP_FLEXCOMM0 interrupt</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>Selects LP_FLEXCOMM1 interrupt</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>Selects LP_FLEXCOMM2 interrupt</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>Selects LP_FLEXCOMM3 interrupt</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>Selects LP_FLEXCOMM4 interrupt</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>Selects LP_FLEXCOMM5 interrupt</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>Selects LP_FLEXCOMM6 interrupt</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>Selects LP_FLEXCOMM7 interrupt</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>Selects LPSPI14 interrupt</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>Selects LPSPI16 interrupt</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>Selects I3C0 interrupt</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>Selects I3C1 interrupt</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>Selects I3C2 interrupt</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>Selects I3C3 interrupt</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>Selects FLEXIO interrupt</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>Selects GPIO0 interrupt</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>Selects GPIO1 interrupt</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>Selects GPIO2 interrupt</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>Selects GPIO3 interrupt</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>Selects GPIO4 interrupt</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>Selects GPIO5 interrupt</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>Selects GPIO6 interrupt</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>Selects GPIO7 interrupt</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>Selects GPIO8 interrupt</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>Selects GPIO9 interrupt</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>Selects GPIO10 interrupt</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>Selects SCT0 interrupt</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>Selects CTIMER0 interrupt</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>Selects CTIMER1 interrupt</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>Selects CTIMER2 interrupt</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>Selects CTIMER3 interrupt</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>Selects CTIMER4 interrupt</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>Selects CTIMER5 interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>Selects CTIMER6 interrupt</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>Selects CTIMER7 interrupt</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>Selects UTICK0 interrupt</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>Selects MRT0 interrupt</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>Selects RTC0 interrupt</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val54</name>
                  <description>Selects OSTIMER event timer CPU0 wakeup/interrupt</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val55</name>
                  <description>Selects WWDT0 interrupt</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>Selects WWDT1 interrupt</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>Selects ADC0 interrupt</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>Selects ACMP0 interrupt</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>Selects MICFIL interrupt</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>Selects MICFIL HWVAD</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>Selects uSDHC0 interrupt</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>Selects uSDHC1 interrupt</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>Selects USB0 interrupt</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>Selects USB1 interrupt</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>Selects LCDIF interrupt</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>Selects VGPU interrupt</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>Selects eDMA0 channel 0 interrupt</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val68</name>
                  <description>Selects eDMA0 channel 1 interrupt</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val69</name>
                  <description>Selects eDMA0 channel 2 interrupt</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val70</name>
                  <description>Selects eDMA0 channel 3 interrupt</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val71</name>
                  <description>Selects eDMA1 channel 0 interrupt</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val72</name>
                  <description>Selects eDMA1 channel 1 interrupt</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val73</name>
                  <description>Selects eDMA1 channel 2 interrupt</description>
                  <value>0x49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val74</name>
                  <description>Selects eDMA1 channel 3 interrupt</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val75</name>
                  <description>Selects eDMA2 channel 0 interrupt</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val76</name>
                  <description>Selects eDMA2 channel 1 interrupt</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val77</name>
                  <description>Selects eDMA2 channel 2 interrupt</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val78</name>
                  <description>Selects eDMA2 channel 3 interrupt</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val79</name>
                  <description>Selects eDMA3 channel 0 interrupt</description>
                  <value>0x4F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val80</name>
                  <description>Selects eDMA3 channel 1 interrupt</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val81</name>
                  <description>Selects eDMA3 channel 2 interrupt</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val82</name>
                  <description>Selects eDMA3 channel 3 interrupt</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val83</name>
                  <description>Selects HiFi1 TIE_EXPSTATE_1</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val84</name>
                  <description>Selects HiFi4 TIE_EXPSTATE_1</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val85</name>
                  <description>Selects SCT0_OUT8</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val86</name>
                  <description>Selects SCT0_OUT9</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val87</name>
                  <description>Selects CTIMER4_MAT3</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val88</name>
                  <description>Selects CTIMER4_MAT2</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val89</name>
                  <description>Selects CTIMER3_MAT3</description>
                  <value>0x59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val90</name>
                  <description>Selects CTIMER3_MAT2</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val91</name>
                  <description>Selects CPU0 TXEV</description>
                  <value>0x5B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val92</name>
                  <description>Selects PINT0 boolean pattern-match output</description>
                  <value>0x5C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val93</name>
                  <description>Selects MIPI_DSI_HOST interrupt</description>
                  <value>0x5D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val94</name>
                  <description>Selects USB0 start of frame</description>
                  <value>0x5E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val95</name>
                  <description>Selects USB1 start of frame</description>
                  <value>0x5F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val96</name>
                  <description>Selects ITRC TMPR_OUT[0]</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val97</name>
                  <description>Selects ITRC TMPR_OUT[1]</description>
                  <value>0x61</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
