Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
        <register>
          <name>MDNBASECLKSEL</name>
          <description>VDDN_MEDIA Base Clock Source Select</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>VDDN_MEDIA Base Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dfro1_div3</name>
                  <description>fro1_div3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro1_max</name>
                  <description>fro1_max</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro0_div3</name>
                  <description>fro0_div3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_clk</name>
                  <description>1m_lposc</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MD2BASECLKSEL</name>
          <description>VDD2_MEDIA Base Clock Source Select</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Media VDD2 Base Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dfro1_div3</name>
                  <description>fro1_div3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro1_max</name>
                  <description>fro1_max</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro0_div3</name>
                  <description>fro0_div3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_clk</name>
                  <description>1m_lposc</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XSPI2FCLKSEL</name>
          <description>XSPI2 Functional Clock Source Select</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>XSPI2 Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>baseclk_comn</name>
                  <description>baseclk_comn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_pll_pfd1</name>
                  <description>audio_pll_pfd1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro0_max</name>
                  <description>fro0_max</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>main_pll_pfd3</name>
                  <description>main_pll_pfd3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for XSPI2 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for XSPI2 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XSPI2FCLKDIV</name>
          <description>XSPI2 Functional Clock Divider</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_IS_NOT_BUSY</name>
                  <description>The CLKOUT is outputted with the new divider value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_IS_BUSY</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Request Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_READY</name>
                  <description>The change to the divider value has been finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_NOT_READY</name>
                  <description>The change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFCLKSEL</name>
          <description>USB0 Functional Clock Source Select</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lp_32k_clk</name>
                  <description>wake32k_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_1m</name>
                  <description>1m_lposc</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>osc_clk_usb</name>
                  <description>osc_clk_usb</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates USB0 clock. It is necessary to read back bit3 with the value of 1 to confirm the clock is already gated then go ahead.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables USB0 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GATED_FLAG</name>
              <description>Gate Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBFCLK_IS_NOT_GATED</name>
                  <description>The USB0 fclk is not gated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBFCLK_IS_GATED</name>
                  <description>The USB0 fclk is gated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>eUSBFCLKSEL</name>
          <description>USB1 (eUSB) Functional Clock Source Select</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>USB1 Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lp_32k_clk</name>
                  <description>wake32k_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_1m</name>
                  <description>1m_lposc</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>osc_clk_eusb</name>
                  <description>osc_clk_eusb</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for USB1 functional clock. It is necessary to read back bit3 with the value of 1 to confirm the clock is already gated then go ahead.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for USB1 functional clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GATED_FLAG</name>
              <description>Gate Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>eUSBFCLK_IS_NOT_GATED</name>
                  <description>The USB1 functional clock is not gated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eUSBFCLK_IS_GATED</name>
                  <description>The USB1 functional clock is gated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO0FCLKSEL</name>
          <description>SDIO0 Functional Clock Source Select</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>SDIO0 Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>baseclk_mdn</name>
                  <description>baseclk_mdn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_pll_pfd0</name>
                  <description>audio_pll_pfd0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro0_max</name>
                  <description>fro0_max</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>main_pll_pfd2</name>
                  <description>main_pll_pfd2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for SD/MMC/SDIO interface 0 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for SD/MMC/SDIO interface 0 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO0FCLKDIV</name>
          <description>SDIO0 Functional Clock Divider</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_IS_NOT_BUSY</name>
                  <description>The CLKOUT is outputted with the new divider value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_IS_BUSY</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>Divider counter Reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_RESET</name>
                  <description>Resets the divider counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Divider Counter Halt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_HALT</name>
                  <description>Halts (stops) the divider counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Request Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_READY</name>
                  <description>The change to the divider value has been finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_NOT_READY</name>
                  <description>The change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO1FCLKSEL</name>
          <description>SDIO1 Functional Clock Source Select</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>SDIO1 Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>baseclk_mdn</name>
                  <description>VDDN_MEDIA base clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_pll_pfd0</name>
                  <description>Audio PLL PFD0 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro0_max</name>
                  <description>fro0_max</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>main_pll_pfd1</name>
                  <description>Main PLL PFD1 clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock Mux Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates mux output for SD/MMC/SDIO interface 1 clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables mux output for SD/MMC/SDIO interface 1 clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
