Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
        <register>
          <name>PIDR</name>
          <description>Port Input Disable</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PID0</name>
              <description>Port Input Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID1</name>
              <description>Port Input Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID2</name>
              <description>Port Input Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID3</name>
              <description>Port Input Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID4</name>
              <description>Port Input Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID5</name>
              <description>Port Input Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID6</name>
              <description>Port Input Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID7</name>
              <description>Port Input Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID8</name>
              <description>Port Input Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID9</name>
              <description>Port Input Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID10</name>
              <description>Port Input Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID11</name>
              <description>Port Input Disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID12</name>
              <description>Port Input Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID13</name>
              <description>Port Input Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID14</name>
              <description>Port Input Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID15</name>
              <description>Port Input Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID16</name>
              <description>Port Input Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID17</name>
              <description>Port Input Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID18</name>
              <description>Port Input Disable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID19</name>
              <description>Port Input Disable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID20</name>
              <description>Port Input Disable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID21</name>
              <description>Port Input Disable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID22</name>
              <description>Port Input Disable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID23</name>
              <description>Port Input Disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID24</name>
              <description>Port Input Disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID25</name>
              <description>Port Input Disable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID26</name>
              <description>Port Input Disable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID27</name>
              <description>Port Input Disable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID28</name>
              <description>Port Input Disable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID29</name>
              <description>Port Input Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID30</name>
              <description>Port Input Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
