Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="AHBSC0">
      <name>AHBSC0_ALIAS1</name>
      <description>AHBSC0</description>
      <groupName>AHBSC0</groupName>
      <baseAddress>0x4017D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="AHBSC0">
      <name>AHBSC0_ALIAS2</name>
      <description>AHBSC0</description>
      <groupName>AHBSC0</groupName>
      <baseAddress>0x4017E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="AHBSC0">
      <name>AHBSC0_ALIAS3</name>
      <description>AHBSC0</description>
      <groupName>AHBSC0</groupName>
      <baseAddress>0x4017F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>ROMCP</name>
      <description>ROMCP</description>
      <groupName>ROMCP</groupName>
      <baseAddress>0x40182000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>15,14,13,12,11,10,9,8,7,6,5,4,3,2,1,0</dimIndex>
          <name>ROMPATCHD%s</name>
          <description>Data Registers</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAX</name>
              <description>Data Fix Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHCNTL</name>
          <description>Control Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAFIX0</name>
              <description>Data Fix Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX1</name>
              <description>Data Fix Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX2</name>
              <description>Data Fix Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX3</name>
              <description>Data Fix Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX4</name>
              <description>Data Fix Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX5</name>
              <description>Data Fix Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX6</name>
              <description>Data Fix Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX7</name>
              <description>Data Fix Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX8</name>
              <description>Data Fix Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX9</name>
              <description>Data Fix Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX10</name>
              <description>Data Fix Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX11</name>
              <description>Data Fix Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX12</name>
              <description>Data Fix Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX13</name>
              <description>Data Fix Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX14</name>
              <description>Data Fix Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX15</name>
              <description>Data Fix Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS</name>
              <description>Patch Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROMCENABLED</name>
                  <description>Does not affect any Patch operations (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROMCDISABLED</name>
                  <description>Disables all Patch operations: data fixing and opcode patching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Register Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>All registers remain accessible (unlocked).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Lock access to all registers. All ROMCP register accesses are treated as read-as-zero, except for this LK bit which reads as set. All writes are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHENH</name>
          <description>Enable Register High</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>ROMPATCHENL</name>
          <description>Enable Register Low</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable Address Comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator is enabled; after the associated address is matched, the ROMC will trigger a opcode patch or data fix event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ROMPATCHA[%s]</name>
          <description>Address Registers</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THUMBX</name>
              <description>THUMB Comparator Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARMPATCH</name>
                  <description>ARM patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THUMBPATCH</name>
                  <description>THUMB patch (ignore if a data fix)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRX</name>
              <description>Address Comparator Registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHSR</name>
          <description>Status Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>ROMCP Source Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMP0MATCHED</name>
                  <description>Address Comparator 0 matched</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMP1MATCHED</name>
                  <description>Address Comparator 1 matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMP15MATCHED</name>
                  <description>Address Comparator 15 matched</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW</name>
              <description>ROMCP AHB Multiple Address Comparator Match Indicator</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCOLLISION</name>
                  <description>No event or comparator collisions have occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLLISION</name>
                  <description>A collision has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
