Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PDM</name>
      <description>MICFIL</description>
      <groupName>PDM</groupName>
      <baseAddress>0x4020E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xAC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL_1</name>
          <description>MICFIL Control 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0EN</name>
              <description>Channel 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1EN</name>
              <description>Channel 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2EN</name>
              <description>Channel 2 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3EN</name>
              <description>Channel 3 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4EN</name>
              <description>Channel 4 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5EN</name>
              <description>Channel 5 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6EN</name>
              <description>Channel 6 Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7EN</name>
              <description>Channel 7 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSYNCEN</name>
              <description>Frame Synchronization Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECFILS</name>
              <description>Decimation Filter Enable in Stop</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stop</name>
                  <description>Stops decimation filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Keeps decimation filter running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERREN</name>
              <description>Error Interruption Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISEL</name>
              <description>DMA Interrupt Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>all_disabled</name>
                  <description>Disables DMA and interrupt requests</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareq_enabled</name>
                  <description>Enables DMA requests</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>intreq_enabled</name>
                  <description>Enables interrupt requests</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGE</name>
              <description>Module Enable in Debug</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disables after completing the current frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enables operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRES</name>
              <description>Software Reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_action</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sw_reset</name>
                  <description>Software reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG</name>
              <description>Debug Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>debug</name>
                  <description>Debug</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMIEN</name>
              <description>MICFIL Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stopped</name>
                  <description>Stops MICFIL operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>started</name>
                  <description>Starts MICFIL operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEN</name>
              <description>Stop Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low_leakage</name>
                  <description>DLL mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_2</name>
          <description>MICFIL Control 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKDIV_0</name>
                  <description>Internal clock divider value = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_1</name>
                  <description>Internal clock divider value = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_2</name>
                  <description>...</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_255</name>
                  <description>Internal clock divider value = 255</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIVDIS</name>
              <description>Clock Divider Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CICOSR</name>
              <description>CIC Decimation Rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CICOSR_0_0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_0_1</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_0_2</name>
                  <description>Not supported</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_0_3</name>
                  <description>Not supported</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_0_4</name>
                  <description>Not supported</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_0_5</name>
                  <description>Not supported</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_0_6</name>
                  <description>Not supported</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_0_7</name>
                  <description>Not supported</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_8</name>
                  <description>CIC oversampling rate = 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_9</name>
                  <description>CIC oversampling rate = 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_10</name>
                  <description>...</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_11</name>
                  <description>...</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_12</name>
                  <description>...</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_13</name>
                  <description>...</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_14</name>
                  <description>...</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_15</name>
                  <description>...</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_16</name>
                  <description>...</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_17</name>
                  <description>...</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_18</name>
                  <description>...</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_19</name>
                  <description>...</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_20</name>
                  <description>...</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_21</name>
                  <description>...</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_22</name>
                  <description>...</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_23</name>
                  <description>...</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_24</name>
                  <description>...</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_25</name>
                  <description>...</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_26</name>
                  <description>...</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_27</name>
                  <description>...</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_28</name>
                  <description>...</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_29</name>
                  <description>...</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_10_30</name>
                  <description>...</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_31</name>
                  <description>CIC oversampling rate = 31</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QSEL</name>
              <description>Quality Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mq_mode</name>
                  <description>Medium-Quality mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hq_mode</name>
                  <description>High-Quality mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vlq2_mode</name>
                  <description>Very-Low-Quality 2 mode</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vlq1_mode</name>
                  <description>Very-Low-Quality 1 mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vlq0_mode</name>
                  <description>Very-Low-Quality 0 mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lq_mode</name>
                  <description>Low-Quality mode</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEC_BYPASS</name>
              <description>Decimation Filter Bypass</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
