Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
        <register>
          <name>PDRUNCFG0</name>
          <description>PD Run Configuration 0 in Compute Domain</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF5776740</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMICMODE</name>
              <description>PMIC Power Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMIC_00</name>
                  <description>Drives PMIC_MODE pins to 0h</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMIC_01</name>
                  <description>Drives PMIC_MODE pins to 1h</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMIC_10</name>
                  <description>Drives PMIC_MODE pins to 2h</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMIC_11</name>
                  <description>Drives PMIC_MODE pins to 3h</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDSR</name>
              <description>Full Deep Sleep Retention (FDSR) Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>All power switch states controlled by their respective PD*CFG bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>All core domains in DSR or Power Down mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD</name>
              <description>Deep Power Down (DPD) Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEP_EN</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_PD</name>
                  <description>Enables DPD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDPD</name>
              <description>Full Deep Power Down (FDPD) Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDEEP_EN</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDEEP_PD</name>
                  <description>Enables FDPD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2COMP_DSR</name>
              <description>Power Switch and DSR Enable in VDD2_COMP Domain</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Powers on VDD2_COMP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>Enables DSR mode in VDD2_COMP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2NMED_DSR</name>
              <description>Power Switch and DSR for VDD2 and VDDN Media</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Powers on VDD2 and VDDN media domains</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>Enables VDD2 and VDDN media domains in DSR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2COM_DSR</name>
              <description>Power Switch and DSR Enable for VDD2_COM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Powers on VDD2_COM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>Enables DSR mode in VDD2_COM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VNCOM_DSR</name>
              <description>Power Switch and DSR for VDDN_COM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Powers on VDDN_COM domain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSR</name>
                  <description>Enables VDDN_COM domain in DSR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2DSP_PD</name>
              <description>Power Down VDD2_DSP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSP_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_PD</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V2MIPI_PD</name>
              <description>Power Down MIPI PHY in VDD2 Domain</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_MODE</name>
              <description>DCDC Power Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_HP</name>
                  <description>Enables DCDC in high-power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_LP</name>
                  <description>Enables DCDC in low-power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_ULP0</name>
                  <description>Enables DCDC in ultra-low-power mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_ULP1</name>
                  <description>Enables DCDC in ultra-low-power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_VSEL</name>
              <description>Select DCDC Voltage</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_VSEL0</name>
                  <description>Selects DCDCVSEL[VSEL0] level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_VSEL1</name>
                  <description>Selects DCDCVSEL[VSEL1] level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO1_MODE</name>
              <description>LDO VDD1 Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_VDD1_SWITCH</name>
                  <description>Bypass mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD1_HP</name>
                  <description>High-power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD1_LP_2</name>
                  <description>Low-power mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD1_LP_3</name>
                  <description>Low-power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO1_VSEL</name>
              <description>LDO VDD1 Voltage Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL00</name>
                  <description>Selects LDOVDD1VSEL[VSEL0] and LVDVDD1CTRL[LVL0] level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL01</name>
                  <description>Selects LDOVDD1VSEL[VSEL1] and LVDVDD1CTRL[LVL1] level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL10</name>
                  <description>Selects LDOVDD1VSEL[VSEL2] and LVDVDD1CTRL[LVL2] level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL11</name>
                  <description>Selects LDOVDD1VSEL[VSEL3] and LVDVDD1CTRL[LVL3] level</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO2_MODE</name>
              <description>LDO VDD2 Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_VDD2_SWITCH</name>
                  <description>Bypass mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD2_HP</name>
                  <description>High-power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD2_LP_2</name>
                  <description>Low-power mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VDD2_LP_3</name>
                  <description>Low-power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO2_VSEL</name>
              <description>Select LDO VDD2 Voltage</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL00</name>
                  <description>Selects LDOVDD2VSEL[VSEL0] and LVDVDD2CTRL[LVL0] level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL01</name>
                  <description>Selects LDOVDD2VSEL[VSEL1] and LVDVDD2CTRL[LVL1] level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL10</name>
                  <description>Selects LDOVDD2VSEL[VSEL2] and LVDVDD2CTRL[LVL2] level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL11</name>
                  <description>Selects LDOVDD2VSEL[VSEL3] and LVDVDD2CTRL[LVL3] level</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBB1_PD</name>
              <description>Power Down RBB in VDD1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBB1_ENABLE</name>
                  <description>If PDRUNCFG0[AFBB1_PD] = 1, power on. Else power down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBB1_DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFBB1_PD</name>
              <description>Power Down AFBB in VDD1 Domain</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBB2_PD</name>
              <description>Power Down RBB in VDD2 Domain</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>If PDRUNCFG0[AFBB2_PD] = 1, power on. Else power down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFBB2_PD</name>
              <description>Power Down AFBB in VDD2 Domain</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBBN_PD</name>
              <description>Power Down RBB in VDDN Domain</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBBN_ENABLE</name>
                  <description>If PDRUNCFG0[AFBBN_PD] = 1, power on. Else power down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBBN_DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFBBN_PD</name>
              <description>Power Down AFBB in VDDN Domain</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBBSR1_PD</name>
              <description>Power Down SRAM RBB in VDD1 Domain</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBBSR1_ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBBSR1_DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBBSR2_PD</name>
              <description>Power Down SRAM RBB in VDD2 Domain</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBBSR2_ENABLE</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBBSR2_DISABLE</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
