Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
        <register>
          <name>TX</name>
          <description>USBPHY Transmitter Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080807</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>HS Transmit Output Current Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCAL20P</name>
                  <description>+20.30%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL17P</name>
                  <description>+17.60%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL14P</name>
                  <description>+14.80%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL12P</name>
                  <description>+12.60%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL8P</name>
                  <description>+8.79%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL6P</name>
                  <description>+6.04%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL2P</name>
                  <description>+2.75%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL0</name>
                  <description>0%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL2N</name>
                  <description>-2.75%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL5N</name>
                  <description>-5.49%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL7N</name>
                  <description>-7.69%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL10N</name>
                  <description>-10.40%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL12N</name>
                  <description>-12.60%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL14N</name>
                  <description>-14.30%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL18N</name>
                  <description>-18.10%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCAL22N</name>
                  <description>-22.00%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DN</name>
              <description>Transmit Calculation 45 ohm DN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DN19P</name>
                  <description>+19.95%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN17P</name>
                  <description>+17.35%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN14P</name>
                  <description>+14.85%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN12P</name>
                  <description>+12.46%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN9P</name>
                  <description>+9.07%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN5P</name>
                  <description>+5.87%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN2P</name>
                  <description>+2.85%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN0</name>
                  <description>0%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN2N</name>
                  <description>-2.70%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN5N</name>
                  <description>-5.25%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN7N</name>
                  <description>-7.67%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN9N</name>
                  <description>-9.98%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN12N</name>
                  <description>-12.17%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN14N</name>
                  <description>-14.25%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN18N</name>
                  <description>-18.14%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN21N</name>
                  <description>-21.68%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Transmit Calculation 45 ohm DP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DP19P</name>
                  <description>+19.95%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP17P</name>
                  <description>+17.35%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP14P</name>
                  <description>+14.85%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP12P</name>
                  <description>+12.46%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP9P</name>
                  <description>+9.07%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP5P</name>
                  <description>+5.87%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP2P</name>
                  <description>+2.85%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP0</name>
                  <description>0%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP2N</name>
                  <description>-2.70%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP5N</name>
                  <description>-5.25%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP7N</name>
                  <description>-7.67%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP9N</name>
                  <description>-9.98%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP12N</name>
                  <description>-12.17%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP14N</name>
                  <description>-14.25%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP18N</name>
                  <description>-18.14%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP21N</name>
                  <description>-21.68%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_SET</name>
          <description>USBPHY Transmitter Control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080807</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>HS Transmit Output Current Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TXCAL45DN</name>
              <description>Transmit Calculation 45 ohm DN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Transmit Calculation 45 ohm DP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CLR</name>
          <description>USBPHY Transmitter Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080807</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>HS Transmit Output Current Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TXCAL45DN</name>
              <description>Transmit Calculation 45 ohm DN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Transmit Calculation 45 ohm DP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_TOG</name>
          <description>USBPHY Transmitter Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080807</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>HS Transmit Output Current Trim</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>TXCAL45DN</name>
              <description>Transmit Calculation 45 ohm DN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Transmit Calculation 45 ohm DP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX</name>
          <description>USBPHY Receiver Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>Envelope Adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_P1</name>
                  <description>0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_P1125</name>
                  <description>0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_P1250</name>
                  <description>0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_P0875</name>
                  <description>0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>Disconnect Adjustment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_P56875</name>
                  <description>0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_P55</name>
                  <description>0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_P58125</name>
                  <description>0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_P6</name>
                  <description>0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>Differential Receiver Bypass</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Operate normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT_SINGLE_END</name>
                  <description>Bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_SET</name>
          <description>USBPHY Receiver Control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>Envelope Adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>Disconnect Adjustment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>Differential Receiver Bypass</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CLR</name>
          <description>USBPHY Receiver Control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>Envelope Adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>Disconnect Adjustment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>Differential Receiver Bypass</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_TOG</name>
          <description>USBPHY Receiver Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>Envelope Adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>Disconnect Adjustment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>Differential Receiver Bypass</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
