Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_ezhv.xml
          <register>
            <name>ASIB_MAX_COMB_OT</name>
            <description>Maximum Combined Outstanding Transactions</description>
            <addressOffset>0x114</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AWAR_MAX_OTF</name>
                <description>Fractional Part of Maximum Combined Outstanding AW and AR Addresses</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AWAR_MAX_OTI</name>
                <description>Integer Part of Maximum Combined Outstanding AW and AR Addresses</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_AW_P</name>
            <description>AW Channel Peak Rate</description>
            <addressOffset>0x118</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_P</name>
                <description>AW Channel Peak Rate</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_AW_B</name>
            <description>AW Channel Burstiness Allowance</description>
            <addressOffset>0x11C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_B</name>
                <description>AW Channel Burstiness</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_AW_R</name>
            <description>AW Channel Average Rate</description>
            <addressOffset>0x120</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_R</name>
                <description>AW Channel Average Rate</description>
                <bitOffset>20</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_AR_P</name>
            <description>AR Channel Peak Rate</description>
            <addressOffset>0x124</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_P</name>
                <description>AR Channel Peak Rate</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_AR_B</name>
            <description>AR Channel Burstiness Allowance</description>
            <addressOffset>0x128</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_B</name>
                <description>AR Channel Burstiness</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_AR_R</name>
            <description>AR Channel Average Rate</description>
            <addressOffset>0x12C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AR_R</name>
                <description>AR Channel Average Rate</description>
                <bitOffset>20</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_TARGET_FC</name>
            <description>Feedback Controlled Target</description>
            <addressOffset>0x130</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_TGT_LATENCY</name>
                <description>AW Channel Target Latency</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AR_TGT_LATENCY</name>
                <description>AR Channel Target Latency</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_KI_FC</name>
            <description>Feedback Controlled Scale</description>
            <addressOffset>0x134</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_KI</name>
                <description>awqos Scale Factor</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SFM3</name>
                    <description>2^-3</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM4</name>
                    <description>2^-4</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_2</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_3</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_4</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_5</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_6</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM10</name>
                    <description>2^-10</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AR_KI</name>
                <description>arqos Scale Factor</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SFM3</name>
                    <description>2^-3</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM4</name>
                    <description>2^-4</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_2</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_3</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_4</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_5</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM5_6</name>
                    <description>2^-5 to 2^-9</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFM10</name>
                    <description>2^-10</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ASIB_QOS_RANGE</name>
            <description>QoS Range</description>
            <addressOffset>0x138</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AW_MIN_QOS</name>
                <description>Minimum awqos</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LO_PRIO</name>
                    <description>The lowest priority</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_1</name>
                    <description>...</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_2</name>
                    <description>...</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_3</name>
                    <description>...</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_4</name>
                    <description>...</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_5</name>
                    <description>...</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_6</name>
                    <description>...</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_7</name>
                    <description>...</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_8</name>
                    <description>...</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_9</name>
                    <description>...</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI_PRIO</name>
                    <description>The highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AW_MAX_QOS</name>
                <description>Maximum awqos</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LO_PRIO</name>
                    <description>The lowest priority</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_1</name>
                    <description>...</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_2</name>
                    <description>...</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_3</name>
                    <description>...</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_4</name>
                    <description>...</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_5</name>
                    <description>...</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_6</name>
                    <description>...</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_7</name>
                    <description>...</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_8</name>
                    <description>...</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_9</name>
                    <description>...</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI_PRIO</name>
                    <description>The highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AR_MIN_QOS</name>
                <description>Minimum arqos</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LO_PRIO</name>
                    <description>The lowest priority</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_1</name>
                    <description>...</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_2</name>
                    <description>...</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_3</name>
                    <description>...</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_4</name>
                    <description>...</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_5</name>
                    <description>...</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_6</name>
                    <description>...</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_7</name>
                    <description>...</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_8</name>
                    <description>...</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_9</name>
                    <description>...</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI_PRIO</name>
                    <description>The highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AR_MAX_QOS</name>
                <description>Maximum arqos</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LO_PRIO</name>
                    <description>The lowest priority</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_1</name>
                    <description>...</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_2</name>
                    <description>...</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_3</name>
                    <description>...</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_4</name>
                    <description>...</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_5</name>
                    <description>...</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_6</name>
                    <description>...</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_7</name>
                    <description>...</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_8</name>
                    <description>...</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED_PRIO_9</name>
                    <description>...</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI_PRIO</name>
                    <description>The highest priority</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
  </peripherals>
</device>